Revit 2027 API
MEPAnalyticalModelData.GetSegmentByIndex Method
 Gets the analytical segment at the specified position.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPAnalyticalSegment GetSegmentByIndex(
	int index
)
Public Function GetSegmentByIndex (
	index As Integer
) As MEPAnalyticalSegment
public:
MEPAnalyticalSegment^ GetSegmentByIndex(
	int index
)
member GetSegmentByIndex :
        index : int -> MEPAnalyticalSegment
Parameters
index Int32
 The index where the segment is stored. This index is 0 based.
Return Value
MEPAnalyticalSegment
 The returned analytical segment.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index must range from 0 to GetNumberOfSegments()-1.
See Also
Reference
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace